var a=function(){
alert ("嘿嘿！中计了，下面配合哥吧！\n\n反正现在你想关也关不掉了~~");
alert ("想关掉的话就要\n\n跟着提示一步步的做\n\n\n或者你干脆就直接关机吧~~");
var x=prompt("请在下面输入 我是猪","");
while(x!="我是猪"){
x=prompt("输入不正确！请在下面输入 我是猪","");
}
alert("不要急！\n\n这句话你还要再输入20遍，\n\n你信不信？？")
var x=prompt("请再输  我是猪","");
while(x!="我是猪"){
x=prompt("输入不正确！请在下面输入 我是猪","");
}
alert ("还要输19次");
var x=prompt("请再输 我是猪","");
while(x!="我是猪"){
x=prompt("输入不正确！请在下面输入 我是猪","");
}
alert ("还要输18次");
var x=prompt("请再输  我是猪","");
while(x!="我是猪"){
x=prompt("输入不正确！请在下面输入 我是猪","");
}
alert ("还要输17次");


alert ("你真笨！！都不会复制粘贴一下吗？？");

alert ("难道你不知道怎么复制粘贴吗？？");

alert ("复制：Ctrl+c\n\n粘贴：Ctrl+v");
for(var i=1;i<17;i++){
var m=prompt("请在下面输入 我是猪","");
while(m!="我是猪"){
m=prompt("输入不正确！请在下面输入 我是猪","");

}
alert ("还要输"+(17-i)+"次");
}
alert("哥现在心情非常之爽！！\n\n\n剩下的这一次就给你免了吧！\n\n\n\n~~哈哈哈哈~~~")
alert ("可爱猪猪，我没有骗你吧！只输了20次哦~");
alert("真是头听话的猪，复制后粘贴了16次哦！！~~")
alert("但是还没有就此结束")
alert("你还需要描述一下你这头猪的属性！")
var x=prompt("请再输 我是活泼可爱的猪","");
while(x!="我是活泼可爱的猪"){
x=prompt("输入不正确！请在下面输入 我是活泼可爱的猪","");
}

var y=prompt("请在输 我是母猪","");
while(y!="我是母猪"){
y=prompt("输入不正确！请在下面输入 我是母猪","");
}
var z=prompt("请再输 我是大肥猪","");
while(z!="我是大肥猪"){
z=prompt("输入不正确！请在下面输入 我是大肥猪","");
}
alert ("哇哈哈！~你终于肯承认了！\n\n还承认的这么彻底！~");
alert ("你这个猪！活泼可爱！母猪！大肥猪！！~");
alert ("你可以把地址发给别人，也来整整他们哦~~");
alert ("好想好想赶紧关掉这个吧！？");
alert ("我只是玩玩而已、、、不要生气哦");
}
a();
